<?php
// Heading
$_['heading_title']                = 'Авторизация';

// Text
$_['text_account']                 = 'Личный Кабинет';
$_['text_login']                   = 'Авторизация';
$_['text_new_customer']            = 'Новый клиент';
$_['text_register']                = 'Регистрация';
$_['text_register_account']        = 'Создание учетной записи поможет покупать быстрее. Вы сможете контролировать состояние заказа, а также просматривать заказы сделанные ранее. Вы сможете накапливать призовые баллы и получать скидочные купоны. <BR>А постоянным покупателям мы предлагаем гибкую систему скидок и персональное обслуживание.<BR>';
$_['text_returning_customer']      = 'Зарегистрированный клиент';
$_['text_i_am_returning_customer'] = 'Войти в Личный Кабинет';
$_['text_forgotten']               = 'Забыли пароль?';

// Entry
$_['entry_email']                  = 'E-Mail';
$_['entry_password']               = 'Пароль';

// Error
$_['error_login']                  = 'Неправильно заполнены поле E-Mail и/или пароль!';
$_['error_attempts']               = 'Вы превысили максимальное количество попыток авторизации. Повторите попытку авторизации на сайте через 1 час';
$_['error_approved']               = 'Необходимо подтвердить аккаунт перед авторизацией.';


// Heading
$_['heading_title']        = 'Регистрация';

// Text
$_['text_account']         = 'Личный Кабинет';
$_['text_register']        = 'Регистрация';
$_['text_account_already'] = 'Если Вы уже зарегистрированы, перейдите на страницу <a href="%s">авторизации</a>.';
$_['text_your_details']    = 'Основные данные';
$_['text_your_address']    = 'Ваш адрес';
$_['text_newsletter']      = 'Рассылка новостей';
$_['text_your_password']   = 'Ваш пароль';
$_['text_agree']           = 'Я прочитал <a href="%s" class="agree"><b>%s</b></a> и согласен с условиями';

// Entry
$_['entry_customer_group'] = 'Направление бизнеса';
$_['entry_firstname']      = 'Имя';
$_['entry_lastname']       = 'Фамилия';
$_['entry_email']          = 'E-Mail';
$_['entry_telephone']      = 'Телефон';
$_['entry_fax']            = 'Факс';
$_['entry_company']        = 'Компания';
$_['entry_address_1']      = 'Адрес 1';
$_['entry_address_2']      = 'Адрес 2';
$_['entry_postcode']       = 'Индекс';
$_['entry_city']           = 'Город';
$_['entry_country']        = 'Страна';
$_['entry_zone']           = 'Регион / Область';
$_['entry_newsletter']     = 'Подписка на новости';
$_['entry_password']       = 'Пароль';
$_['entry_confirm']        = 'Подтверждение пароля';

// Error
$_['error_exists']         = 'Данный E-Mail уже зарегистрирован!';
$_['error_firstname']      = 'Имя должно быть от 1 до 32 символов!';
$_['error_lastname']       = 'Фамилия должна быть от 1 до 32 символов!';
$_['error_email']          = 'E-Mail введен неправильно!';
$_['error_telephone']      = 'Телефон должен быть от 3 до 32 цифр!';
$_['error_address_1']      = 'Адрес должен быть от 3 до 128 символов!';
$_['error_city']           = 'Название города должно быть от 2 до 128 символов!';
$_['error_postcode']       = 'Индекс должен быть от 2 до 10 символов!';
$_['error_country']        = 'Выберите страну!';
$_['error_zone']           = 'Выберите регион / область!';
$_['error_custom_field']   = '%s обязательно к заполнению!';
$_['error_password']       = 'В пароле должно быть от 4 до 20 символов!';
$_['error_confirm']        = 'Пароли и пароль подтверждения не совпадают!';
$_['error_agree']          = 'Вы должны прочитать и согласится с %s!';